(() => {
  'use strict';

  const Slugify = require('../index');

  const DICTIONARY = {
    a: 'AⒶＡÀÁÂẦẤẪẨÃĀĂẰẮẴẲȦǠÄǞẢÅǺǍȀȂẠẬẶḀĄȺⱯaⓐａẚàáâầấẫẩãāăằắẵẳȧǡäǟảåǻǎȁȃạậặḁąⱥɐ',
    aa: 'Ꜳꜳ',
    ae: 'ÆǼǢæǽǣ',
    ao: 'Ꜵꜵ',
    au: 'Ꜷꜷ',
    av: 'ꜸꜺꜹꜻ',
    ay: 'Ꜽꜽ',
    b: 'BⒷＢḂḄḆɃƂƁbⓑｂḃḅḇƀƃɓ',
    c: 'CⒸＣĆĈĊČÇḈƇȻꜾcⓒｃćĉċčçḉƈȼꜿↄ',
    d: 'DⒹＤḊĎḌḐḒḎĐƋƊƉꝹdⓓｄḋďḍḑḓḏđƌɖɗꝺ',
    dz: 'ǱǄǲǅǳǆ',
    e: 'EⒺＥÈÉÊỀẾỄỂẼĒḔḖĔĖËẺĚȄȆẸỆȨḜĘḘḚƐƎeⓔｅèéêềếễểẽēḕḗĕėëẻěȅȇẹệȩḝęḙḛɇɛǝ',
    f: 'FⒻＦḞƑꝻfⓕｆḟƒꝼ',
    g: 'GⒼＧǴĜḠĞĠǦĢǤƓꞠꝽꝾgⓖｇǵĝḡğġǧģǥɠꞡᵹꝿ',
    h: 'HⒽＨĤḢḦȞḤḨḪĦⱧⱵꞍhⓗｈĥḣḧȟḥḩḫẖħⱨⱶɥ',
    hv: 'ƕ',
    i: 'IⒾＩÌÍÎĨĪĬİÏḮỈǏȈȊỊĮḬƗiⓘｉìíîĩīĭïḯỉǐȉȋịįḭɨı',
    j: 'JⒿＪĴɈjⓙｊĵǰɉ',
    k: 'KⓀＫḰǨḲĶḴƘⱩꝀꝂꝄꞢkⓚｋḱǩḳķḵƙⱪꝁꝃꝅꞣ',
    l: 'LⓁＬĿĹĽḶḸĻḼḺŁȽⱢⱠꝈꝆꞀlⓛｌŀĺľḷḹļḽḻſłƚɫⱡꝉꞁꝇ',
    lj: 'Ǉǈǉ',
    m: 'MⓂＭḾṀṂⱮƜmⓜｍḿṁṃɱɯ',
    n: 'NⓃＮǸŃÑṄŇṆŅṊṈȠƝꞐꞤnⓝｎǹńñṅňṇņṋṉƞɲŉꞑꞥ',
    nj: 'Ǌǋǌ',
    o: 'OⓄＯÒÓÔỒỐỖỔÕṌȬṎŌṐṒŎȮȰÖȪỎŐǑȌȎƠỜỚỠỞỢỌỘǪǬØǾƆƟꝊꝌoⓞｏòóôồốỗổõṍȭṏōṑṓŏȯȱöȫỏőǒȍȏơờớỡởợọộǫǭøǿɔꝋꝍɵ',
    oi: 'Ƣƣ',
    oo: 'Ꝏꝏ',
    ou: 'Ȣȣ',
    p: 'PⓅＰṔṖƤⱣꝐꝒꝔpⓟｐṕṗƥᵽꝑꝓꝕ',
    q: 'QⓆＱꝖꝘɊqⓠｑɋꝗꝙ',
    r: 'RⓇＲŔṘŘȐȒṚṜŖṞɌⱤꝚꞦꞂrⓡｒŕṙřȑȓṛṝŗṟɍɽꝛꞧꞃ',
    s: 'SⓈＳẞŚṤŜṠŠṦṢṨȘŞⱾꞨꞄsⓢｓßśṥŝṡšṧṣṩșşȿꞩꞅẛ',
    t: 'TⓉＴṪŤṬȚŢṰṮŦƬƮȾꞆtⓣｔṫẗťṭțţṱṯŧƭʈⱦꞇ',
    tz: 'Ꜩꜩ',
    u: 'UⓊＵÙÚÛŨṸŪṺŬÜǛǗǕǙỦŮŰǓȔȖƯỪỨỮỬỰỤṲŲṶṴɄuⓤｕùúûũṹūṻŭüǜǘǖǚủůűǔȕȗưừứữửựụṳųṷṵʉ',
    v: 'VⓋＶṼṾƲꝞɅvⓥｖṽṿʋꝟʌ',
    vy: 'Ꝡꝡ',
    w: 'WⓌＷẀẂŴẆẄẈⱲwⓦｗẁẃŵẇẅẘẉⱳ',
    x: 'XⓍＸẊẌxⓧｘẋẍ',
    y: 'YⓎＹỲÝŶỸȲẎŸỶỴƳɎỾyⓨｙỳýŷỹȳẏÿỷẙỵƴɏỿ',
    z: 'ZⓏＺŹẐŻŽẒẔƵȤⱿⱫꝢzⓩｚźẑżžẓẕƶȥɀⱬꝣ'
  };

  describe('Slugify', () => {
    describe('parse', () => {
      it('should be a promise', () => {
        expect(Slugify.parse()).toBeInstanceOf(Promise);
      });
    });

    describe('parseSync', () => {
      it('should reduce sequentual dashes into one', () => {
        expect(Slugify.parseSync('test - - - string')).toStrictEqual('test-string');
      });

      describe('diacritics', () => {
        Object.keys(DICTIONARY).forEach((key) => {
          DICTIONARY[key].split('').forEach((char) => {
            it(`should convert ${char} to ${key}`, () => {
              expect(Slugify.parseSync(char)).toStrictEqual(key);
            });
          });
        });
      });
    });
  });
})();
